# US - Baby Names



### Step 1. Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset

In [3]:
pd.read_csv("C:/python_advance/US_Baby_Names.csv")

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 3. Assign it to a variable called baby_names.

In [5]:
baby_names = pd.read_csv("C:/python_advance/US_Baby_Names.csv")

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [10]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)
# 9165800969

In [11]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [12]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

In [8]:
print(baby_names['Gender'].value_counts())

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [29]:
#is questions me similar name ka count nikalna hai 
# jo mene kiya tha galat kiya tha 
# names = baby_names.groupby["Name"].agg({"Name": "count"})
# names

#by sir 
names = baby_names.Name.value_counts()
names

Name
Riley        1112
Avery        1080
Jordan       1073
Peyton       1064
Hayden       1049
             ...
Anaka           1
Montanna        1
Thaddaeus       1
Miroslav        1
Ackley          1
Name: count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

In [19]:

baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [27]:
baby_names['Name'].max()

'Zyriah'

### Step 10. How many different names have the least occurrences?

In [39]:
a= baby_names['Name'].value_counts()
a
b= a.min()
b

np.int64(1)

In [13]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

In [15]:
baby_names.Name.value_counts()[-2:-1]

Name
Miroslav    1
Name: count, dtype: int64

In [34]:
names_counts = baby_names.groupby('Name')['Count'].sum()

In [35]:
names_counts

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

### Step 11. What is the median name occurrence?

In [24]:
names

Name
Riley        1112
Avery        1080
Jordan       1073
Peyton       1064
Hayden       1049
             ...
Anaka           1
Montanna        1
Thaddaeus       1
Miroslav        1
Ackley          1
Name: count, Length: 17632, dtype: int64

In [26]:
baby_names['Count'].median()

np.float64(11.0)

In [36]:
names_counts.median()

np.float64(49.0)

### Step 12. What is the standard deviation of names?

In [13]:
names_counts.std()

np.float64(11006.06946789057)

In [37]:
# by sir
baby_names.Count.std()

np.float64(97.39734648617814)

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [14]:
names_counts.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64